# GuidValue Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SharedParameterElement..::..GuidValue Property
SharedParameterElement Class See Also
---
The Guid that identifies this shared parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public Guid GuidValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property GuidValue As Guid
	Get
```

Visual C++
---
```text
public:
property Guid GuidValue {
	Guid get ();
}
```

# See Also
SharedParameterElement Class
Autodesk.Revit.DB Namespace